Revit 2027 API
ElementRecord Methods
The ElementRecord type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBoundingBox |  Gets the bounding box of the element record.
GetCategoryId |  Gets the category id of the element record.
GetDesignOptionId |  Gets the design option id of the element record.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetId |  Gets the id of the element record.
GetOwnerViewId |  Gets the element id of the owner view record.
GetType | Gets the Type of the current instance.
(Inherited from Object)
HasBoundingBox |  Determines whether this element record has a bounding box.
IsAnElementType |  Identifies if the element record represents an ElementType.
IsCurveDriven |  Identifies if the element is curve driven.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ElementRecord Class
Autodesk.Revit.DB Namespace